# Урок 1
# a = input('Введите своё имя: ')
# print('Hello', a)

# print(type(a))

# a = 20
# b = input('Введите своё число: ')
# b = int(b)
# # print(type(a))
# # print(type(b))
# print(a + b, end='---')
# print(a - b, end='---')
# print(a * b)

# a = input('Введите своё число: ')
# a = int(a)
# b = a - 1
# c = a + 1
# print('Ваше число - ', a, ' предыдущее число - ', b, ' следующее число - ', c)
# print()
# print('Ваше число - ', a, end=' ')
# print(' предыдущее число - ', b, end=' ')
# print(' следующее число - ', c, end=' ')


# Типы данных
# str
# int


# Функции
# type() - узнать тип переменной
# print() - напечатать информацию в терминал
# input() - запросить информацию из терминала
# int() - переводит из строки в число

# Аргументы
# end='' - для функции print

# Задание 1
# 1. Получаешь из терминала приветствие
# 2. Получаешь имя человека
# 3. Здороваешься с ним
